<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Ramsey\Uuid\Type\Integer;

class CoachSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('coaches')->insert([
            'name' => 'Петро',
            'surname' => 'Василенко',
            'phone_number' => '0991234567',
            'one_session_price' => 300,
            'description_title' => 'ТРЕНЕР БОЙОВИХ МИСТЕЦТВ ТА ФІТНЕСУ',
            'description_body' => 'Майстер спорту України з боксу. Неодноразовий призер і переможець змагань з боксу і фітнесу.',
            'resume' => 'Життя пов\'язане з спортом вже 24 роки. Пропонує Вам: Бойові мистецтва, Силовий тренінг, Функціональний тренінг, Тренування: для зменшення ваги, для набору м\'язової маси, для виділення рельєфу і формування фігури без нарощування м\'язів, техніка підтримання досягнутих результатів.'
        ]);
        DB::table('coaches')->insert([
            'name' => 'Василь',
            'surname' => 'Андрійович',
            'phone_number' => '0991834567',
            'one_session_price' => 400,
            'description_title' => 'ТРЕНЕР БОЙОВИХ МИСТЕЦТВ',
            'description_body' => 'Майстер спорту України з айкідо.',
            'resume' => 'Життя пов\'язане з спортом вже 10 років. Пропонує Вам: Бойові мистецтва, Силовий тренінг, Функціональний тренінг, Тренування: для зменшення ваги, для набору м\'язової маси, для виділення рельєфу і формування фігури без нарощування м\'язів, техніка підтримання досягнутих результатів.'

        ]);
        DB::table('coaches')->insert([
            'name' => 'Марія',
            'surname' => 'Миколаївна',
            'phone_number' => '0991835967',
            'one_session_price' => 500,
            'description_title' => 'ТРЕНЕР ЗІ СТРЕТЧИНГУ',
            'description_body' => 'Майстер спорту з гімнастики.',
            'resume' => 'Життя пов\'язане з спортом вже 10 років. Пропонує Вам групові та індивідуальні заняття зі стретчингу.'
        ]);
    }
}
